---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredRoughness
source: html/f7b6fd2f-2476-e89b-4307-65bab012278f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredRoughness Property

The property labeled "Roughness" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string LayeredRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.